app/controllers/properties_controller.rb

INSERT INTO "properties" ("asking_price", "city", "created_at", "full_property_description", "meta_description", "meta_keyword", "short_property_description", "square_feet", "street_address", "updated_at", "user_id", "video", "year_built", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
 @property=   current_user.properties.new(params[:property])
 #a.build_property_garage(params[:property][:property_garage_attributes])
 if @property.save